-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Июн 05 2026 г., 22:08
-- Версия сервера: 10.4.32-MariaDB
-- Версия PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `cafe_db`
--

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` int(5) NOT NULL,
  `category` varchar(70) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `category`) VALUES
(1, 'Кава'),
(2, 'Чай'),
(3, 'Десерти');

-- --------------------------------------------------------

--
-- Структура таблицы `menu`
--

CREATE TABLE `menu` (
  `id` int(5) NOT NULL,
  `name` varchar(50) NOT NULL,
  `image` varchar(255) NOT NULL,
  `description` varchar(255) NOT NULL,
  `price` float NOT NULL,
  `category_id` int(5) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `menu`
--

INSERT INTO `menu` (`id`, `name`, `image`, `description`, `price`, `category_id`) VALUES
(1, 'Еспресо', 'espresso.jpg', 'Міцний концентрований кавовий напій', 40, 1),
(2, 'Американо', 'americano.jpg', 'Кавовий напій, приготований шляхом додавання великої кількості води до стандартного еспресо', 45, 1),
(3, 'Американо з молоком', 'americano_with_milk.jpg', 'Кавовий напій на основі еспресо, з додаванням молока', 55, 1),
(4, 'Лате', 'latte.jpg', 'Кавовий напій на основі молока, що є тришаровою сумішшю з молочної піни, молока і кави еспресо', 70, 1),
(5, 'Капучино', 'cappuccino.jpg', 'Кавовий напій на основі еспресо з додаванням збитого парою молока', 65, 1),
(6, 'Флет вайт', 'flat_white.jpg', 'Кавовий напій, що складається з подвійної порції еспресо та молочної піни', 80, 1),
(7, 'Чай \"Earl Grey\"', 'earl_grey.jpg', 'Заварний чорний чай з бергамотом', 40, 2),
(8, 'М\'ятний чай', 'mint_tea.jpg', 'Ароматний заварний трав\'яний чай з листя м\'яти', 40, 2),
(9, 'Зелений чай', 'green_tea.jpg', 'Ароматний заварний зелений чай без добавок', 40, 2),
(10, 'Чай \"Milk Oolong\"', 'milk_oolong.jpg', 'Молочний улун - вид чаю улун з характерими вершковими нотками', 40, 2),
(11, 'Чай матча', 'matcha.jpg', 'Різновид японського пропареного зеленого чаю, розтовченого у дрібний порошок. Чай має злегка горіховий, трав\'янистий смак з відтінком гіркоти', 60, 2),
(12, 'Матча лате', 'matcha_latte.jpg', 'Напій на основі матча з додаванням підігрітого вспіненого молока', 80, 2),
(13, 'Тирамісу', 'tiramisu.jpg', 'Італійський десерт на основі сиру маскарпоне, як наповнювач додається печиво «савоярді», кава та какао. \r\nМістить (можливі алергени): како-порошок, яйця курячі, борошно, сир \"Маскарпоне\", кава', 130, 3),
(14, 'Чизкейк', 'cheesecake.jpg', 'Страва європейської та американської кухні, що являє собою сирний десерт. \r\nМістить (можливі алергени): борошно, цукор, сир \"Маскарпоне\", яйця курячі, молоко', 120, 3),
(15, 'Круасан з шоколадом', 'croissant_chocolate.jpg', 'Традиційний для французької та австрійської кухонь невеликий хлібо-булочний кондитерський виріб із листкового тіста у формі півмісяця з шоколодною начинкою. \r\nМістить (можливі алергени): молоко, борошно, масло вершкове, шоколад', 130, 3),
(16, 'Круасан з полуницею', 'croissant_strawberry.jpg', 'Традиційний для французької та австрійської кухонь невеликий хлібо-булочний кондитерський виріб із листкового тіста у формі півмісяця з полуничною начинкою. \r\nМістить (можливі алергени): молоко, борошно, масло вершкове, полуниця', 130, 3),
(17, '\"Пташине молоко\"', 'bird\'s_milk.jpg', 'Ніжний десерт, який складається з тонкого шару бісквіту, товстого шару повітряного вершково-яєчного суфле та шоколадної глазурі зверху. \r\nМістить (можливі алергени): молоко, борошно, яйця, масло вершкове, агар-агар, цукор', 150, 3),
(18, 'Полунична панакота', 'strawberry_panna_cotta.jpg', 'Італійський п\'ємонтський десерт з вершків, молока, цукру та желатину з додаванням полуничного сиропу. \r\nМістить (можливі алергени): вершки, цукор, желатин, полуниця', 100, 3);

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE `orders` (
  `id` int(5) NOT NULL,
  `user` varchar(30) DEFAULT NULL,
  `date` datetime NOT NULL DEFAULT current_timestamp(),
  `to_go` tinyint(1) NOT NULL,
  `total_price` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `user`, `date`, `to_go`, `total_price`) VALUES
(38, NULL, '2026-05-22 16:48:27', 0, 105),
(39, 'alex21', '2026-05-22 16:49:18', 1, 170),
(40, 'alex21', '2026-05-22 20:30:35', 0, 200),
(41, 'alex21', '2026-05-23 11:06:35', 0, 275),
(42, 'alex21', '2026-05-23 11:07:29', 0, 410),
(43, 'singer32', '2026-05-23 20:07:57', 0, 200),
(44, NULL, '2026-05-24 08:17:04', 0, 135),
(45, NULL, '2026-05-24 08:17:16', 0, 110),
(46, NULL, '2026-05-24 08:17:29', 0, 120),
(47, NULL, '2026-05-24 08:17:46', 0, 220),
(48, NULL, '2026-05-24 08:18:00', 0, 175),
(49, NULL, '2026-05-24 08:18:23', 0, 165),
(50, NULL, '2026-05-24 08:20:17', 0, 220),
(52, NULL, '2026-05-24 10:04:48', 0, 190),
(53, NULL, '2026-05-24 10:06:50', 0, 400),
(54, NULL, '2026-05-24 10:07:16', 0, 240),
(55, NULL, '2026-05-24 10:07:25', 0, 200),
(56, NULL, '2026-05-24 10:07:50', 0, 410),
(57, NULL, '2026-05-24 10:08:05', 0, 210),
(58, NULL, '2026-05-24 10:08:20', 0, 260),
(59, NULL, '2026-05-24 10:08:37', 0, 350),
(60, NULL, '2026-05-24 10:08:54', 0, 390),
(61, NULL, '2026-05-24 10:09:16', 0, 160),
(62, NULL, '2026-05-24 10:09:27', 0, 320),
(63, NULL, '2026-05-24 10:11:13', 0, 170),
(64, NULL, '2026-05-24 10:11:28', 0, 395),
(65, NULL, '2026-05-24 10:11:41', 0, 355),
(66, NULL, '2026-05-24 10:11:50', 0, 170),
(67, NULL, '2026-05-24 10:12:01', 0, 260),
(68, NULL, '2026-05-24 10:12:53', 0, 135),
(69, NULL, '2026-05-24 10:13:10', 0, 645),
(70, NULL, '2026-05-24 10:13:20', 0, 255),
(71, NULL, '2026-05-24 10:41:00', 0, 300),
(72, NULL, '2026-05-24 10:41:13', 0, 255),
(73, NULL, '2026-05-24 10:41:30', 0, 390),
(74, 'alex21', '2026-05-24 10:48:58', 0, 370),
(75, 'alex21', '2026-05-24 10:49:21', 0, 370),
(76, 'alex21', '2026-05-24 10:49:59', 0, 195),
(77, NULL, '2026-05-25 20:02:19', 1, 190),
(78, NULL, '2026-05-25 21:23:38', 1, 300),
(79, NULL, '2026-05-25 21:46:34', 1, 250),
(80, NULL, '2026-05-26 02:07:04', 1, 200),
(81, 'alchemist13', '2026-05-26 02:08:31', 1, 160),
(82, 'alchemist13', '2026-05-26 02:08:43', 0, 160),
(83, NULL, '2026-05-26 02:09:08', 1, 365),
(84, NULL, '2026-05-26 02:09:23', 0, 320),
(85, NULL, '2026-05-26 02:09:37', 0, 215),
(86, NULL, '2026-05-26 02:09:47', 0, 220),
(87, NULL, '2026-05-26 02:10:03', 0, 230),
(88, NULL, '2026-05-26 02:10:14', 0, 160),
(89, NULL, '2026-05-26 02:10:25', 0, 160),
(90, NULL, '2026-05-26 02:10:58', 0, 340),
(91, NULL, '2026-05-26 02:11:12', 0, 310),
(92, NULL, '2026-05-26 02:11:34', 0, 355),
(93, NULL, '2026-05-26 02:11:58', 0, 160),
(94, NULL, '2026-05-26 02:12:14', 0, 330),
(95, NULL, '2026-05-26 02:12:51', 1, 160),
(96, NULL, '2026-05-26 02:13:35', 0, 390),
(97, NULL, '2026-05-26 02:13:46', 1, 80),
(98, NULL, '2026-05-26 02:13:58', 0, 200),
(99, NULL, '2026-05-26 02:14:44', 1, 420),
(100, NULL, '2026-05-26 02:15:06', 0, 40),
(101, NULL, '2026-05-26 02:15:13', 0, 120),
(102, NULL, '2026-05-26 02:16:50', 0, 215),
(103, NULL, '2026-05-26 02:17:07', 0, 380),
(104, NULL, '2026-05-26 02:17:21', 0, 380),
(105, NULL, '2026-05-26 02:17:51', 0, 370),
(106, NULL, '2026-05-26 02:18:04', 0, 170),
(107, NULL, '2026-05-26 02:18:21', 1, 365),
(108, NULL, '2026-05-26 02:18:37', 0, 330),
(109, NULL, '2026-05-26 02:19:33', 0, 370),
(110, NULL, '2026-05-26 02:19:39', 0, 130),
(111, NULL, '2026-05-26 02:19:47', 0, 80),
(112, NULL, '2026-05-26 09:36:54', 1, 180),
(113, NULL, '2026-05-26 14:59:20', 1, 250),
(114, 'alex21', '2026-05-28 10:26:51', 1, 370),
(115, 'alex21', '2026-05-28 10:29:49', 1, 370),
(116, NULL, '2026-05-29 11:18:42', 0, 200),
(117, NULL, '2026-05-29 11:20:16', 0, 350),
(118, NULL, '2026-05-29 11:20:35', 0, 400),
(119, NULL, '2026-05-29 11:20:46', 0, 200),
(120, 'alex21', '2026-05-29 21:09:11', 0, 185),
(121, NULL, '2026-05-31 12:57:23', 0, 140),
(122, NULL, '2026-05-31 12:58:02', 0, 340),
(123, NULL, '2026-05-31 12:58:18', 0, 320),
(124, NULL, '2026-05-31 12:58:37', 0, 410),
(125, NULL, '2026-06-01 09:37:44', 0, 180),
(126, 'alex21', '2026-06-01 20:54:34', 0, 160),
(127, NULL, '2026-06-01 20:54:59', 0, 140);

-- --------------------------------------------------------

--
-- Структура таблицы `order_items`
--

CREATE TABLE `order_items` (
  `id` int(5) NOT NULL,
  `order_id` int(5) NOT NULL,
  `product_id` int(5) NOT NULL,
  `size` enum('standard','small','medium','large') NOT NULL DEFAULT 'standard',
  `quantity` int(2) NOT NULL,
  `price` float NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `order_items`
--

INSERT INTO `order_items` (`id`, `order_id`, `product_id`, `size`, `quantity`, `price`) VALUES
(32, 38, 2, 'small', 1, 45),
(33, 38, 10, 'large', 1, 60),
(34, 39, 4, 'large', 1, 90),
(35, 39, 7, 'small', 2, 40),
(36, 40, 6, 'large', 1, 100),
(37, 40, 10, 'medium', 2, 50),
(38, 41, 9, 'medium', 2, 50),
(39, 41, 3, 'small', 1, 55),
(40, 41, 7, 'large', 1, 60),
(41, 41, 1, 'large', 1, 60),
(42, 42, 1, 'small', 1, 40),
(43, 42, 2, 'small', 1, 45),
(44, 42, 3, 'small', 1, 55),
(45, 42, 4, 'medium', 1, 80),
(46, 42, 10, 'large', 1, 60),
(47, 42, 8, 'medium', 1, 50),
(48, 42, 12, 'small', 1, 80),
(49, 43, 10, 'medium', 2, 50),
(50, 43, 6, 'large', 1, 100),
(51, 44, 5, 'small', 1, 65),
(52, 44, 4, 'small', 1, 70),
(53, 45, 4, 'small', 1, 70),
(54, 45, 9, 'small', 1, 40),
(55, 46, 12, 'small', 1, 80),
(56, 46, 8, 'small', 1, 40),
(57, 47, 2, 'small', 1, 45),
(58, 47, 5, 'small', 1, 65),
(59, 47, 4, 'small', 1, 70),
(60, 47, 7, 'small', 1, 40),
(61, 48, 4, 'small', 1, 70),
(62, 48, 5, 'small', 1, 65),
(63, 48, 10, 'small', 1, 40),
(64, 49, 4, 'large', 1, 90),
(65, 49, 5, 'medium', 1, 75),
(66, 50, 4, 'large', 1, 90),
(67, 50, 3, 'small', 1, 55),
(68, 50, 5, 'medium', 1, 75),
(71, 52, 4, 'small', 1, 70),
(72, 52, 14, 'standard', 1, 120),
(73, 53, 1, 'small', 1, 40),
(74, 53, 13, 'standard', 2, 130),
(75, 53, 18, 'standard', 1, 100),
(76, 54, 4, 'small', 1, 70),
(77, 54, 16, 'standard', 1, 130),
(78, 54, 7, 'small', 1, 40),
(79, 55, 4, 'small', 1, 70),
(80, 55, 16, 'standard', 1, 130),
(81, 56, 15, 'standard', 1, 130),
(82, 56, 16, 'standard', 1, 130),
(83, 56, 4, 'small', 1, 70),
(84, 56, 12, 'small', 1, 80),
(85, 57, 1, 'small', 1, 40),
(86, 57, 13, 'standard', 1, 130),
(87, 57, 8, 'small', 1, 40),
(88, 58, 13, 'standard', 1, 130),
(89, 58, 1, 'small', 1, 40),
(90, 58, 6, 'medium', 1, 90),
(91, 59, 17, 'standard', 1, 150),
(92, 59, 14, 'standard', 1, 120),
(93, 59, 10, 'small', 1, 40),
(94, 59, 7, 'small', 1, 40),
(95, 60, 4, 'small', 1, 70),
(96, 60, 16, 'standard', 1, 130),
(97, 60, 13, 'standard', 1, 130),
(98, 60, 1, 'large', 1, 60),
(99, 61, 10, 'small', 1, 40),
(100, 61, 14, 'standard', 1, 120),
(101, 62, 9, 'small', 1, 40),
(102, 62, 11, 'small', 1, 60),
(103, 62, 14, 'standard', 1, 120),
(104, 62, 18, 'standard', 1, 100),
(105, 63, 1, 'small', 1, 40),
(106, 63, 13, 'standard', 1, 130),
(107, 64, 1, 'small', 1, 40),
(108, 64, 5, 'medium', 1, 75),
(109, 64, 17, 'standard', 1, 150),
(110, 64, 13, 'standard', 1, 130),
(111, 65, 1, 'small', 1, 40),
(112, 65, 3, 'small', 1, 55),
(113, 65, 16, 'standard', 1, 130),
(114, 65, 13, 'standard', 1, 130),
(115, 66, 13, 'standard', 1, 130),
(116, 66, 1, 'small', 1, 40),
(117, 67, 13, 'standard', 1, 130),
(118, 67, 16, 'standard', 1, 130),
(119, 68, 4, 'small', 1, 70),
(120, 68, 5, 'small', 1, 65),
(121, 69, 6, 'small', 1, 80),
(122, 69, 5, 'small', 1, 65),
(123, 69, 4, 'large', 1, 90),
(124, 69, 15, 'standard', 1, 130),
(125, 69, 16, 'standard', 1, 130),
(126, 69, 17, 'standard', 1, 150),
(127, 70, 5, 'small', 1, 65),
(128, 70, 4, 'small', 1, 70),
(129, 70, 14, 'standard', 1, 120),
(130, 71, 4, 'small', 1, 70),
(131, 71, 16, 'standard', 1, 130),
(132, 71, 18, 'standard', 1, 100),
(133, 72, 16, 'standard', 1, 130),
(134, 72, 4, 'small', 1, 70),
(135, 72, 2, 'medium', 1, 55),
(136, 73, 1, 'small', 1, 40),
(137, 73, 4, 'large', 1, 90),
(138, 73, 13, 'standard', 1, 130),
(139, 73, 16, 'standard', 1, 130),
(140, 74, 1, 'small', 1, 40),
(141, 74, 13, 'standard', 1, 130),
(142, 74, 4, 'small', 1, 70),
(143, 74, 16, 'standard', 1, 130),
(144, 75, 15, 'standard', 1, 130),
(145, 75, 18, 'standard', 1, 100),
(146, 75, 7, 'small', 1, 40),
(147, 75, 6, 'large', 1, 100),
(148, 76, 5, 'medium', 1, 75),
(149, 76, 14, 'standard', 1, 120),
(150, 77, 1, 'small', 1, 40),
(151, 77, 17, 'standard', 1, 150),
(152, 78, 1, 'small', 1, 40),
(153, 78, 13, '', 1, 130),
(154, 78, 16, 'standard', 1, 130),
(155, 79, 6, 'small', 1, 80),
(156, 79, 1, 'small', 1, 40),
(157, 79, 13, 'standard', 1, 130),
(158, 80, 16, 'standard', 1, 130),
(159, 80, 4, 'small', 1, 70),
(160, 81, 7, 'small', 1, 40),
(161, 81, 14, 'standard', 1, 120),
(162, 82, 7, 'small', 1, 40),
(163, 82, 14, 'standard', 1, 120),
(164, 83, 7, 'small', 1, 40),
(165, 83, 3, 'small', 1, 55),
(166, 83, 14, 'standard', 1, 120),
(167, 83, 17, 'standard', 1, 150),
(168, 84, 14, 'standard', 2, 120),
(169, 84, 7, 'small', 1, 40),
(170, 84, 10, 'small', 1, 40),
(171, 85, 7, 'small', 1, 40),
(172, 85, 14, 'standard', 1, 120),
(173, 85, 3, 'small', 1, 55),
(174, 86, 7, 'small', 1, 40),
(175, 86, 12, 'small', 1, 80),
(176, 86, 18, 'standard', 1, 100),
(177, 87, 14, 'standard', 1, 120),
(178, 87, 7, 'small', 1, 40),
(179, 87, 4, 'small', 1, 70),
(180, 88, 14, 'standard', 1, 120),
(181, 88, 7, 'small', 1, 40),
(182, 89, 7, 'small', 1, 40),
(183, 89, 14, 'standard', 1, 120),
(184, 90, 8, 'small', 1, 40),
(185, 90, 7, 'medium', 1, 50),
(186, 90, 14, 'standard', 1, 120),
(187, 90, 13, 'standard', 1, 130),
(188, 91, 7, 'small', 1, 40),
(189, 91, 14, 'standard', 1, 120),
(190, 91, 17, 'standard', 1, 150),
(191, 92, 16, 'standard', 1, 130),
(192, 92, 7, 'small', 1, 40),
(193, 92, 14, 'standard', 1, 120),
(194, 92, 5, 'small', 1, 65),
(195, 93, 7, 'small', 1, 40),
(196, 93, 14, 'standard', 1, 120),
(197, 94, 7, 'small', 1, 40),
(198, 94, 10, 'small', 1, 40),
(199, 94, 14, 'standard', 1, 120),
(200, 94, 16, 'standard', 1, 130),
(201, 95, 7, 'small', 1, 40),
(202, 95, 14, 'standard', 1, 120),
(203, 96, 7, 'small', 1, 40),
(204, 96, 12, 'small', 1, 80),
(205, 96, 14, 'standard', 1, 120),
(206, 96, 17, 'standard', 1, 150),
(207, 97, 8, 'small', 1, 40),
(208, 97, 7, 'small', 1, 40),
(209, 98, 14, 'standard', 1, 120),
(210, 98, 6, 'small', 1, 80),
(211, 99, 14, 'standard', 1, 120),
(212, 99, 15, 'standard', 1, 130),
(213, 99, 11, 'large', 1, 80),
(214, 99, 4, 'large', 1, 90),
(215, 100, 7, 'small', 1, 40),
(216, 101, 14, 'standard', 1, 120),
(217, 102, 1, 'small', 1, 40),
(218, 102, 2, 'small', 1, 45),
(219, 102, 13, 'standard', 1, 130),
(220, 103, 4, 'small', 1, 70),
(221, 103, 1, 'medium', 1, 50),
(222, 103, 13, 'standard', 1, 130),
(223, 103, 16, 'standard', 1, 130),
(224, 104, 1, 'large', 2, 60),
(225, 104, 13, 'standard', 2, 130),
(226, 105, 1, 'small', 1, 40),
(227, 105, 9, 'small', 1, 40),
(228, 105, 13, 'standard', 1, 130),
(229, 105, 14, 'standard', 1, 120),
(230, 105, 7, 'small', 1, 40),
(231, 106, 1, 'small', 1, 40),
(232, 106, 13, 'standard', 1, 130),
(233, 107, 13, 'standard', 1, 130),
(234, 107, 18, 'standard', 1, 100),
(235, 107, 1, 'small', 2, 40),
(236, 107, 2, 'medium', 1, 55),
(237, 108, 4, 'small', 1, 70),
(238, 108, 16, 'standard', 1, 130),
(239, 108, 15, 'standard', 1, 130),
(240, 109, 16, 'standard', 1, 130),
(241, 109, 13, 'standard', 1, 130),
(242, 109, 1, 'small', 1, 40),
(243, 109, 4, 'small', 1, 70),
(244, 110, 13, 'standard', 1, 130),
(245, 111, 4, 'medium', 1, 80),
(246, 112, 7, 'large', 1, 60),
(247, 112, 14, 'standard', 1, 120),
(248, 113, 4, 'large', 1, 90),
(249, 113, 7, 'small', 1, 40),
(250, 113, 14, 'standard', 1, 120),
(251, 114, 15, 'standard', 1, 130),
(252, 114, 18, 'standard', 1, 100),
(253, 114, 7, 'small', 1, 40),
(254, 114, 6, 'large', 1, 100),
(255, 115, 1, 'small', 1, 40),
(256, 115, 13, 'standard', 1, 130),
(257, 115, 4, 'small', 1, 70),
(258, 115, 16, 'standard', 1, 130),
(259, 116, 4, 'small', 1, 70),
(260, 116, 16, 'standard', 1, 130),
(261, 117, 4, 'small', 1, 70),
(262, 117, 16, 'standard', 1, 130),
(263, 117, 17, 'standard', 1, 150),
(264, 118, 6, 'small', 1, 80),
(265, 118, 4, 'large', 1, 90),
(266, 118, 18, 'standard', 1, 100),
(267, 118, 16, 'standard', 1, 130),
(268, 119, 4, 'small', 1, 70),
(269, 119, 16, 'standard', 1, 130),
(270, 120, 3, 'small', 1, 55),
(271, 120, 16, 'standard', 1, 130),
(272, 121, 10, 'small', 1, 40),
(273, 121, 18, 'standard', 1, 100),
(274, 122, 6, 'small', 1, 80),
(275, 122, 10, 'small', 1, 40),
(276, 122, 14, 'standard', 1, 120),
(277, 122, 18, 'standard', 1, 100),
(278, 123, 1, 'small', 1, 40),
(279, 123, 17, 'standard', 1, 150),
(280, 123, 15, 'standard', 1, 130),
(281, 124, 1, 'small', 1, 40),
(282, 124, 6, 'small', 1, 80),
(283, 124, 10, 'small', 1, 40),
(284, 124, 17, 'standard', 1, 150),
(285, 124, 18, 'standard', 1, 100),
(286, 125, 10, 'small', 1, 40),
(287, 125, 18, 'standard', 1, 100),
(288, 125, 1, 'small', 1, 40),
(289, 126, 6, 'small', 1, 80),
(290, 126, 12, 'small', 1, 80),
(291, 127, 1, 'small', 1, 40),
(292, 127, 18, 'standard', 1, 100);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `login` varchar(30) NOT NULL,
  `password` varchar(255) NOT NULL,
  `name` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`login`, `password`, `name`) VALUES
('alchemist13', '$2y$10$yz.2ELEDEhMrX//fJZ6kmOTycbuXvRqfnOnDQtJWHX6tyRxIYf97K', 'Albedo'),
('alex21', '$2y$10$AAQbS7qzgFXV0ggBQxlsLej5PXDp/WBxGga6reD13WmqJxIffPZHi', 'Alex'),
('singer32', '$2y$10$Gin1/BBAYCeqS2ZnKKxHJuDmjLUAQ1XEuE6Xj5ZyF.4oCsY84XZ4O', 'Robin'),
('teaparty8', '$2y$10$DFYq48pLfhbUx9d2kcjqTeWDnops2v/QykFO30hTWaqVuEchQ5oRu', 'Alice');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `menu`
--
ALTER TABLE `menu`
  ADD PRIMARY KEY (`id`),
  ADD KEY `category_id` (`category_id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user` (`user`);

--
-- Индексы таблицы `order_items`
--
ALTER TABLE `order_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `order_id` (`order_id`),
  ADD KEY `product_id` (`product_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`login`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `menu`
--
ALTER TABLE `menu`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=128;

--
-- AUTO_INCREMENT для таблицы `order_items`
--
ALTER TABLE `order_items`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=293;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `menu`
--
ALTER TABLE `menu`
  ADD CONSTRAINT `menu_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`);

--
-- Ограничения внешнего ключа таблицы `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `orders_ibfk_1` FOREIGN KEY (`user`) REFERENCES `users` (`login`);

--
-- Ограничения внешнего ключа таблицы `order_items`
--
ALTER TABLE `order_items`
  ADD CONSTRAINT `order_items_ibfk_1` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`),
  ADD CONSTRAINT `order_items_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `menu` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
